import React from "react";
import DescriptionAboutLessons from ".";

const descriptionBlock = [
  {
    number: "01",
    text: "Знайомить вас з потужним концентратом даних про три аспекти часів та усі характерні для них категорії. За допомогою цікавих схематичних пояснень ви довідаєтеся як розпізнавати графічні елементи часових формна авторській діаграмі, створеній для простішого розуміння цих досіскладних конструкцій англійської граматики. В цьому уроці ви також дізнаєтеся звідки у англійській мові аж 12 часів і чому вони насправділогічніші за будь які потенційно можливі варіанти опису дій у іншихмовах! За допомогою запропонованих умовних позначень для побудовиформул часу ви з легкістю зрозумієте як створити потрібну, не завчаючи її напам’ять! Отакої!"
  },
  {
    number: "02",
    text: "У цьому відео-уроці детальніше розглядаються часові конструкції теперішнього аспекту та випадки контекстуальних вживань часів Present Simple, Present Continuous, Present Perfect та Present Perfect Continuous у різних (стверджувальних, заперечних та запитальних) варіантах речень у кумедних мікро контекстах. Вам вдасться побудувати першу частину часової діаграми, а також перевірити розуміння почутого за допомогою запропонованого завдання на уважність помічником Хельги,вигаданим кумедним персонажем - равликом Едді!"
  },
  {
    number: "03",
    text: "Цей відео-урок демонструє логіку побудови часів минулого аспекту та випадки контекстуальних вживань Past Simple, Past Continuous, Past Perfect та Past Perfect Continuous у стверджувальних, заперечних та запитальних варіантах речень і доводить, що ці часові конструкції формуються по аналогії з усіма іншими. Цього разу часова діаграма отримає візуалізацію своєї наступної частини з елементами часів минулого аспекту. Разом з Хельгою та равликом Едді ви перевірите правильність розуміння поясненого матеріалу за допомогою завдання та розберете імовірно допущені помилки, які неминуче трапляються на усіх етапах навчання."
  },
  {
    number: "04",
    text: "Завершальний відео-урок цього міні курсу не лише дасть вичерпні відповіді на запитання, що стосуються аспекту майбутнього, побудови елементів його часових форм і властивих йому додаткових конструкцій, а й допоможе вам нарешті скласти цілісний пазл усіх існуючих часів англійської мови, які ви з легкістю зможете ідентифікувати і використовувати для ваших особистих комунікативних потреб. У цьому уроці додатково подано варіанти таблиць англійською та українською мовами з прикладами речень у всіх часах, а також зведену діаграму усіх часових аспектів та категорій, що безумовно слугуватиме вам надійною підказкою у потрібний момент."
  }
];

const DescriptionsBlockLessons = () => {
  return (
    <>
      <DescriptionAboutLessons decription={descriptionBlock} />;
    </>
  );
};
export default DescriptionsBlockLessons;
